app/views/photos/index.html.erb

        <% @commentPerPhoto.each do |comment| %>
            <% @commentBy = User.find(comment.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]