app/controllers/photos_controller.rb

  def index
    @users = User.find(params[:id])
    @photos = Photo.where(:user_id => @users)
    @comments = Comment.where(:photo_id => @photos)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = ?  [["user_id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = '1' AND "comments"."photo_id" IN (SELECT "photos"."id" FROM "photos" WHERE "photos"."user_id" = '1') AND "comments"."photo_id" = ?  [["photo_id", "2"]]